Autodesk.Revit.DB.BuiltInFailures.TrussFailures.TrussUserDefinedMemberNotJoined
Both start and end of web must intersect the truss.

Autodesk.Revit.DB.BuiltInFailures.TrussFailures.TrussUserDefinedMemberDeleted
A user-defined structural member was deleted due to missing or deleted references.

Autodesk.Revit.DB.BuiltInFailures.TrussFailures.TrussNotJoinedWebs
The current edits are causing some webs to disjoin.  The truss layout family requires additional constraints to maintain these joins.

Autodesk.Revit.DB.BuiltInFailures.TrussFailures.TrussLayoutOverlapedCurves
The current transformation of this specific truss layout will some sub members to overlap.

Autodesk.Revit.DB.BuiltInFailures.TrussFailures.TrussLayoutNonSympleTopChord
This truss layout family defines an offset or non horizontal top chord.  This may conflict with attachment or profile editing.

Autodesk.Revit.DB.BuiltInFailures.TrussFailures.TrussIsAttachedTo
Revit cannot attach to the chosen Roof/Slab.  The truss cannot project to a surface or the attachment creates an invalid profile.

Autodesk.Revit.DB.BuiltInFailures.TrussFailures.TrussInvalidSymbolGeom
Truss is unable to generate any members due to layout family error.

Autodesk.Revit.DB.BuiltInFailures.TrussFailures.TrussDuplicateEngineeringType
Elements have duplicate 'Engineering Type' values.

Autodesk.Revit.DB.BuiltInFailures.TrussFailures.TrussChordUntransformable
Unable to maintain user changes to unpinned Chord. Restoring Truss-defined shape.

Autodesk.Revit.DB.BuiltInFailures.TrussFailures.TrussBadTransformation
Revit cannot transform the truss Layout Family to the Truss as oriented in the project.

Autodesk.Revit.DB.BuiltInFailures.TrussFailures.RemoveTrussSketch
Remove Sketch

Autodesk.Revit.DB.BuiltInFailures.TrussFailures.InvalidWorkplaneForStructuralFraming
Workplane not valid for Structural Framing component "[Family Name]"

Autodesk.Revit.DB.BuiltInFailures.TrussFailures.IncorrectWallUsageWithAttachedStruct
A structural framing element is attached to a wall whose Structural Usage is set to [Usage].

Autodesk.Revit.DB.BuiltInFailures.TrussFailures
Failures about Truss.